import { Product } from '../entities/product.entity';

import { Connection } from 'typeorm';
import { Factory, Seeder } from 'typeorm-seeding';

import { faker } from '@faker-js/faker';

export default class CreateProduct implements Seeder {
  public async run(factory: Factory, connection: Connection): Promise<any> {
    await connection.query('SET FOREIGN_KEY_CHECKS=0');
    await connection.query('TRUNCATE TABLE product');
    await connection.query('TRUNCATE TABLE product_specific');
    await connection.query('TRUNCATE TABLE product_color_variant');
    await connection.query('TRUNCATE TABLE product_description');
    faker.locale = 'fa';
    for (let i = 1; i <= 100; i++) {
      const name = faker.commerce.productName();
      await connection.getRepository(Product).save([
        {
          brand: { id: 1 },
          cardImage: '921bb62db33fd32bf896ca8f9b9488c7',
          images: [
            '30932c486fc344a377c44822453e52e4',
            'ssdas',
            'sdsda',
            'sdsdsad',
          ],
          name: name,
          category: { id: Math.floor(Math.random() * 11) + 1 },

          colorVariants: [
            {
              color: { code: '#FF3131' },
              price: Math.round(Math.random() * 1000) * 1000,
              stock: 10,
              discount: Math.random() > 0.5 ? 50000 : 0,
            },
            {
              color: { code: '#31FFD3' },
              price: Math.round(Math.random() * 10000000),
              stock: 10,
              discount: Math.random() > 0.5 ? 50000 : 0,
            },
          ],
          specifics: [
            {
              specific: { id: 1 },
              value: '16.9 × 229.9 × 357.8 میلی متر',
            },
          ],

          descriptions: [
            {
              title: 'نقد و بررسی پوکو X3 GT',
              body: 'شیائومی پوکو X3 GT یک گوشی میان رده می باشد که به لطف بهره مندی از قابلیت های فراوان، عملکردی شبیه به پرچمداران را ارائه می دهد و توانسته کاربران زیادی را مجذوب خود سازد. ابعاد در نظر گرفته شده برای بدنه دستگاه معادل 163.3 در 75.9 در 8.9 میلی متر است و به لطف بهره مندی از متریال اصولی در ساخت آن، تنها از وزن 193 گرم برخوردار است که حمل آسانی را برای کاربر فراهم می سازد؛ به علاوه این کمپانی یک رنگ جدید با نام Stargaze Black را برای شیائومی پوکو X3 GT در نظر گرفته که به ذرات ریز درخشنده ای مزین شده است و جلوه ی خاصی را از محصول به نمایش می گذارد و نگاه هر بیننده ای را مجذوب خود می سازد. از دیگر ویژگی های گوشی می توان به نمایشگر 6.6 اینچی آن با نرخ تازه سازی 120 هرتز و پشتیبانی از 16 میلیون رنگ اشاره کرد که کیفیت HDR10 را ارائه می دهد و به هنگام تماشای محتواهای مختلف گذر زمان را احساس نخواهید کرد. در بخش دوربین، شاهد یک لنز 64 مگاپیکسلی، لنز فوق عریض 8 مگاپیکسلی و حسگر ماکرو 2 مگاپیکسلی می باشیم که هر کدام قابلیت های متفاوتی دارند و در کنار هم تصاویری با کیفیت بالا را به ثبت می رسانند همچنین لنز سلفی 16 مگاپیکسلی تعبیه شده در پنل جلویی علاوه بر ثبت تصاویر به شما این امکان را می دهد که فیلم های جذابی را با کیفیت 1080 و سرعت 30 فریم بر ثانیه ذخیره نمایید. به لطف بهره مندی از پردازنده ی مرکزی 8 هسته ای، Poco X3 GT قابلیت پشتیبانی از شبکه ی ارتباطی 5G را دارد که نشان از هم سو بودن این کمپانی با تکنولوژی های روز دنیا است به علاوه امکانات بی نظیر دیگری را نیز در اختیار شما قرار داده است. به عنوان تکمیل کننده ی این قابلیت ها می توان به باتری فوق العاده ی آن اشاره کنیم که انرژی مورد نیاز خود را تنها در 42 دقیقه دریافت می کند که هیچ جای بحثی را باقی نگذاشته و نظرات مثبت زیادی را متوجه خود ساخته است.',
            },
            {
              title: 'طراحی',
              body: 'گوشی موبایل آنر 50 لایت در ابعاد 161.8 در 74.7 در 8.5 میلی متر طراحی شده و از وزن 192 گرم برخوردار است که این ابعاد و وزن مناسب حملی آسان را برای شما به ارمغان می آورد تا بتوانید همیشه آن را همراه خود داشته باشید. این محصول در رنگ های مشکی، نقره ای و آبی عرضه شده که در کنار طراحی زیبای آن، محصولی بی نقص را به ارمغان آورده است. در پنل پشتی یک ماژول دایره ای شکل با حاشیه ای براق در نظر گرفته شده که محل قرار گیری دوربین های اصلی می باشد و به زیبا تر دیده شدن بدنه ی یکنواخت کمک می کند. برای این مدل از کمپانی آنر یک نمایشگر 6.67 اینچی در نظر گرفته شده که به لطف بهره مندی از حاشیه های ظریف و ناچ قطره ای دید کاربر را به خوبی بهبود می بخشد. در سمت راست، پایین کلید های کنترل میزان صدا یک حسگر اثر انگشت با ادغام دکمه ی پاور قرار گرفته که با اندکی فشار عملیات مورد نظر شما را اجرایی می کند.',
            },
            {
              title: 'نمایشگر',
              body: 'نمایشگر در نظر گرفته شده برای گوشی Honor 50 Lite NTN-L22 از اندازه ای برابر 6.67 اینچ برخوردار است و از نوع IPS LCD می باشد که لذت تماشای محتواهای مختلف را دو چندان می کند. این نمایشگر از رزولوشن 1080 در 2376 پیکسل برخوردار است و در هر اینچ توانسته 391 پیکسل را جای دهد؛ از این رو فیلم ها و تصاویر را با بهترین کیفیت و در بالاترین وضوح به تصویر می کشد و جزئیات را به خوبی به نمایش می گذارد و توانسته انتظارات کاربران را به خوبی برآورده سازد.',
            },
            {
              title: 'دوربین',
              body: 'در پنل پشتی آنر 50 لایت شاهد قرار گیری 4 دوربین اصلی درون یک محفظه دایره ای شکل هستیم که به ترتیب دارای کیفیت های 64، 8، 2 و 2 مگاپیکسل می باشند و هر یک امکانات مختلفی را در اختیار کاربر قرار می دهند. لنز اول از نوع عریض با گشودگی دیافراگم 1.9/f روی سوژه ی مورد نظر فوکوس می کند تا تصاویری با کیفیت عالی به ثبت برسانید؛ همچنین لنز دوم از نوع فوق عریض با گشودگی دیافراگم 2.4/f می باشد و در نهایت دو حسگر ماکرو و عمق که به بهبود کیفیت تصاویر بسیار کمک می کنند. شما با استفاده از این 4 لنز قدرتمند تعبیه شده برای Honor 50 Lite ضمن ثبت تصاویری جذاب، می توانید فیلم هایی با کیفیت 1080 در 1920 پیکسل را ذخیره کنید. یک لنز سلفی با کیفیت 16 مگاپیکسل از نوع عریض در قسمت بالای پنل جلویی تعبیه شده که قادر است فیلم هایی با کیفیت 1080 پیکسل و نرخ 30 فریم بر ثانیه را به ثبت برساند و برای پاسخ به تماس تصویری امکانات بی نظیری را ارائه می دهد.',
            },
            {
              title: 'باتری',
              body: 'ای این گوشی خوش ساخت یک باتری لیتیوم یونی قدرتمند در نظر گرفته شده که ظرفیتی برابر 4300 میلی آمپر ساعت دارد و سبب شده تا با یک مرتبه دریافت شارژ، با توجه به سیستم سخت افزاری و روشنایی نمایشگر عملکرد رضایت بخشی را ارائه دهد. باتری گوشی Honor 50 Lite NTN-L22 از قابلیت فست شارژ پشتیبانی می کند؛ بدین ترتیب می توانید با توان 66 وات در مدت زمان کوتاهی انرژی از دست رفته ی آن را مجدد بازیابی کنید.',
            },
            {
              title: 'سخت افزار و نرم افزار',
              body: 'این محصول با سیستم عامل اندروید نسخه ی 11 عرضه شده که امکانات بی نظیری را به ارمغان آورده است تا بتوانید هر گونه بازی و نرم افزاری را به سادگی نصب نمایید. ظرفیت حافظه ی در نظر گرفته شده برای آنر 50 لایت معادل 128 گیگابایت است و از رم 8 گیگابایتی برخودار است که فضای گسترده ای را برای ذخیره سازی انواع فایل ها فراهم آورده و سرعت عالی را به سیستم بخشیده است تا به هنگام کار با آن نهایت لذت را ببرید. این گوشی با پشتیبانی از زبان و منوی فارسی یک انتخاب ایده آل برای فارسی زبان ها محسوب می شود.',
            },
          ],
        },
      ]);
    }
    await connection.query('SET FOREIGN_KEY_CHECKS=1');
  }
}
